project-chip/connectedhomeip/src/platform/nRF5/BLEManagerImpl.cpp
/*
 *
 *    Copyright (c) 2020 Project CHIP Authors
 *    Copyright (c) 2018 Nest Labs, Inc.
 *
 *    Licensed under the Apache License, Version 2.0 (the "License");
 *    you may not use this file except in compliance with the License.
 *    You may obtain a copy of the License at
 *
 *        http://www.apache.org/licenses/LICENSE-2.0
 *
 *    Unless required by applicable law or agreed to in writing, software
 *    distributed under the License is distributed on an "AS IS" BASIS,
 *    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *    See the License for the specific language governing permissions and
 *    limitations under the License.
 */

/**
 *    @file
 *          Provides an implementation of the BLEManager singleton object
 *          for the nRF5 platforms.
 */
/* this file behaves like a config.h, comes first */
#include <platform/internal/CHIPDeviceLayerInternal.h>

#if CHIP_DEVICE_CONFIG_ENABLE_CHIPOBLE

#include <ble/CHIPBleServiceData.h>
#include <platform/internal/BLEManager.h>

#include <support/CodeUtils.h>
#include <support/logging/CHIPLogging.h>

#include "ble.h"
#include "ble_advdata.h"
#include "ble_gap.h"
#include "ble_gattc.h"
#include "ble_srv_common.h"
#include "nrf_ble_gatt.h"
#include "nrf_error.h"

#ifdef SOFTDEVICE_PRESENT
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"
#endif

#if CHIP_ENABLE_OPENTHREAD
extern "C" {
#include <openthread/platform/platform-softdevice.h>
}
#endif // CHIP_ENABLE_OPENTHREAD

#define NRF_LOG_MODULE_NAME chip
#include "nrf_log.h"

#if NRF_LOG_ENABLED
#include "nrf_log_backend_uart.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#endif // NRF_LOG_ENABLED

using namespace chip::Ble;

namespace chip {
namespace DeviceLayer {
namespace Internal {

namespace {

const uint16_t UUID16_CHIPoBLEService = 0xFEAF;
const ble_uuid_t UUID_CHIPoBLEService = { UUID16_CHIPoBLEService, BLE_UUID_TYPE_BLE };

const ble_uuid128_t UUID128_CHIPoBLEChar_RX = { { 0x11, 0x9D, 0x9F, 0x42, 0x9C, 0x4F, 0x9F, 0x95, 0x59, 0x45, 0x3D, 0x26, 0xF5,
                                                  0x2E, 0xEE, 0x18 } };
ble_uuid_t UUID_CHIPoBLEChar_RX;
const ChipBleUUID chipUUID_CHIPoBLEChar_RX = { { 0x18, 0xEE, 0x2E, 0xF5, 0x26, 0x3D, 0x45, 0x59, 0x95, 0x9F, 0x4F, 0x9C, 0x42, 0x9F,
                                                 0x9D, 0x11 } };

const ble_uuid128_t UUID128_CHIPoBLEChar_TX = { { 0x12, 0x9D, 0x9F, 0x42, 0x9C, 0x4F, 0x9F, 0x95, 0x59, 0x45, 0x3D, 0x26, 0xF5,
                                                  0x2E, 0xEE, 0x18 } };
ble_uuid_t UUID_CHIPoBLEChar_TX;
const ChipBleUUID chipUUID_CHIPoBLEChar_TX = { { 0x18, 0xEE, 0x2E, 0xF5, 0x26, 0x3D, 0x45, 0x59, 0x95, 0x9F, 0x4F, 0x9C, 0x42, 0x9F,
                                                 0x9D, 0x12 } };

NRF_BLE_GATT_DEF(GATTModule);

CHIP_ERROR RegisterVendorUUID(ble_uuid_t & uuid, const ble_uuid128_t & vendorUUID)
{
    CHIP_ERROR err;

    err = sd_ble_uuid_vs_add(&vendorUUID, &uuid.type);
    SuccessOrExit(err);

    uuid.uuid = (((uint16_t) vendorUUID.uuid128[13]) << 8) | vendorUUID.uuid128[12];

exit:
    return err;
}

} // unnamed namespace

BLEManagerImpl BLEManagerImpl::sInstance;
#ifndef CHIP_DEVICE_LAYER_BLE_OBSERVER_PRIORITY
#define CHIP_DEVICE_LAYER_BLE_OBSERVER_PRIORITY 3
#endif // CHIP_DEVICE_LAYER_BLE_OBSERVER_PRIORITY

#if defined(SOFTDEVICE_PRESENT)

static void OnSoCEvent(uint32_t sys_evt, void * p_context)
{
#if CHIP_ENABLE_OPENTHREAD
    otSysSoftdeviceSocEvtHandler(sys_evt);
#endif
    UNUSED_PARAMETER(p_context);
}

#endif // defined(SOFTDEVICE_PRESENT)

static uint32_t LogTimestamp(void)
{
    return 0;
}

CHIP_ERROR BLEManagerImpl::_PlatformInit()
{
    CHIP_ERROR err = CHIP_NO_ERROR;

#if defined(SOFTDEVICE_PRESENT)

    err = nrf_sdh_enable_request();
    SuccessOrExit(err);

    while (!nrf_sdh_is_enabled())
    {
    }

    // Register a handler for SOC events.
    NRF_SDH_SOC_OBSERVER(m_soc_observer, NRF_SDH_SOC_STACK_OBSERVER_PRIO, OnSoCEvent, NULL);

    {
        uint32_t appRAMStart = 0;

        // Configure the BLE stack using the default settings.
        // Fetch the start address of the application RAM.
        err = nrf_sdh_ble_default_cfg_set(CHIP_DEVICE_LAYER_BLE_CONN_CFG_TAG, &appRAMStart);
        SuccessOrExit(err);

        // Enable BLE stack.
        err = nrf_sdh_ble_enable(&appRAMStart);
        SuccessOrExit(err);
    }
#endif // defined(SOFTDEVICE_PRESENT)

exit:
    return err;
}

CHIP_ERROR BLEManagerImpl::_Init()
{
    CHIP_ERROR err;
    uint16_t svcHandle;
    ble_add_char_params_t addCharParams;

    mServiceMode = ConnectivityManager::kCHIPoBLEServiceMode_Enabled;
    mFlags       = kFlag_AdvertisingEnabled;
    mAdvHandle   = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
    mNumGAPCons  = 0;
    for (int i = 0; i < kMaxConnections; i++)
    {
        mSubscribedConIds[i] = BLE_CONNECTION_UNINITIALIZED;
    }

    NRF_LOG_INFO("Starting BLE initialization");
    NRF_LOG_FLUSH();

    // Initialize the CHIP BleLayer.
    err = BleLayer::Init(this, this, &SystemLayer);
    SuccessOrExit(err);

    // Initialize the Softdevice
    err = _PlatformInit();
    SuccessOrExit(err);

    // Register vendor-specific UUIDs with the soft device.
    //     NOTE: An NRF_ERROR_NO_MEM here means the soft device hasn't been configured
    //     with space for enough custom UUIDs.  Typically, this limit is set by overriding
    //     the NRF_SDH_BLE_VS_UUID_COUNT config option.
    err = RegisterVendorUUID(UUID_CHIPoBLEChar_RX, UUID128_CHIPoBLEChar_RX);
    SuccessOrExit(err);
    err = RegisterVendorUUID(UUID_CHIPoBLEChar_TX, UUID128_CHIPoBLEChar_TX);
    SuccessOrExit(err);

    // Add the CHIPoBLE service.
    err = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, (ble_uuid_t *) &UUID_CHIPoBLEService, &svcHandle);
    SuccessOrExit(err);

    // Add the CHIPoBLEChar_RX characteristic to the CHIPoBLE service.
    memset(&addCharParams, 0, sizeof(addCharParams));
    addCharParams.uuid                     = UUID_CHIPoBLEChar_RX.uuid;
    addCharParams.uuid_type                = UUID_CHIPoBLEChar_RX.type;
    addCharParams.max_len                  = NRF_SDH_BLE_GATT_MAX_MTU_SIZE;
    addCharParams.init_len                 = 0;
    addCharParams.is_var_len               = true;
    addCharParams.char_props.write_wo_resp = 1;
    addCharParams.char_props.write         = 1;
    addCharParams.read_access              = SEC_OPEN;
    addCharParams.write_access             = SEC_OPEN;
    addCharParams.cccd_write_access        = SEC_NO_ACCESS;
    err                                    = characteristic_add(svcHandle, &addCharParams, &mCHIPoBLECharHandle_RX);
    SuccessOrExit(err);

