project-chip/connectedhomeip/src/platform/nRF5/BLEManagerImpl.cpp
    // Set advertising parameters.
    memset(&gapAdvParams, 0, sizeof(gapAdvParams));
    gapAdvParams.primary_phy   = BLE_GAP_PHY_1MBPS;
    gapAdvParams.duration      = BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED;
    gapAdvParams.filter_policy = BLE_GAP_ADV_FP_ANY;

    // Advertise connectable if we haven't reached the maximum number of CHIPoBLE connections or the
    // maximum number of GAP connections.  (Note that the SoftDevice will return an error if connectable
    // advertising is requested when the max number of GAP connections exist).
    numCHIPoBLECons = NumConnections();
    connectable     = (numCHIPoBLECons < kMaxConnections && mNumGAPCons < NRF_SDH_BLE_PERIPHERAL_LINK_COUNT);
    gapAdvParams.properties.type =
        connectable ? BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED : BLE_GAP_ADV_TYPE_NONCONNECTABLE_SCANNABLE_UNDIRECTED;

    // Advertise in fast mode if not fully provisioned and there are no CHIPoBLE connections, or
    // if the application has expressly requested fast advertising.
    // TODO: Return back the !ConfigurationMgr().IsFullyProvisioned() checking when the ConfigurationMgr() will be available
    gapAdvParams.interval =
        ((numCHIPoBLECons == 0 /* && !ConfigurationMgr().IsFullyProvisioned()*/) || GetFlag(mFlags, kFlag_FastAdvertisingEnabled))
        ? CHIP_DEVICE_CONFIG_BLE_FAST_ADVERTISING_INTERVAL
        : CHIP_DEVICE_CONFIG_BLE_SLOW_ADVERTISING_INTERVAL;

#if CHIP_PROGRESS_LOGGING

    {
        char devNameBuf[kMaxDeviceNameLength + 1];
        GetDeviceName(devNameBuf, sizeof(devNameBuf));
        ChipLogProgress(DeviceLayer, "Configuring CHIPoBLE advertising (interval %" PRIu32 " ms, %sconnectable, device name %s)",
                        (((uint32_t) gapAdvParams.interval) * 10) / 16, (connectable) ? "" : "non-", devNameBuf);
    }

#endif // CHIP_PROGRESS_LOGGING

    // Configure an "advertising set" in the BLE soft device with the data and parameters for CHIP advertising.
    // If the advertising set doesn't exist, this call will create it and return its handle.
    err = sd_ble_gap_adv_set_configure(&mAdvHandle, &gapAdvData, &gapAdvParams);
    if (err != CHIP_NO_ERROR)
    {
        ChipLogError(DeviceLayer, "sd_ble_gap_adv_set_configure() failed: %s", ErrorStr(err));
    }
    SuccessOrExit(err);

    // Instruct the BLE soft device to start advertising using the configured advertising set.
    err = sd_ble_gap_adv_start(mAdvHandle, CHIP_DEVICE_LAYER_BLE_CONN_CFG_TAG);
    if (err != CHIP_NO_ERROR)
    {
        ChipLogError(DeviceLayer, "sd_ble_gap_adv_start() failed: %s", ErrorStr(err));
    }
    SuccessOrExit(err);

    // Transition to the Advertising state...
    if (!GetFlag(mFlags, kFlag_Advertising))
    {
        ChipLogProgress(DeviceLayer, "CHIPoBLE advertising started");

        SetFlag(mFlags, kFlag_Advertising);

        // Post a CHIPoBLEAdvertisingChange(Started) event.
        {
            ChipDeviceEvent advChange;
            advChange.Type                             = DeviceEventType::kCHIPoBLEAdvertisingChange;
            advChange.CHIPoBLEAdvertisingChange.Result = kActivity_Started;
            PlatformMgr().PostEvent(&advChange);
        }
    }

exit:
    return err;
}

CHIP_ERROR BLEManagerImpl::StopAdvertising(void)
{
    CHIP_ERROR err = CHIP_NO_ERROR;

    // Since we're about to update the SoftDevice, clear the refresh needed flag.
    ClearFlag(mFlags, kFlag_AdvertisingRefreshNeeded);

    // Instruct the SoftDevice to stop advertising.
    // Ignore any error indicating that advertising is already stopped.  This case is arises
    // when a connection is established, which causes the SoftDevice to immediately cease
    // advertising.
    err = sd_ble_gap_adv_stop(mAdvHandle);
    if (err == NRF_ERROR_INVALID_STATE)
    {
        err = CHIP_NO_ERROR;
    }
    SuccessOrExit(err);

    // Transition to the not Advertising state...
    if (GetFlag(mFlags, kFlag_Advertising))
    {
        ClearFlag(mFlags, kFlag_Advertising);

        ChipLogProgress(DeviceLayer, "CHIPoBLE advertising stopped");

        // Directly inform the ThreadStackManager that CHIPoBLE advertising has stopped.
#if CHIP_DEVICE_CONFIG_ENABLE_THREAD
        ThreadStackMgr().OnCHIPoBLEAdvertisingStop();
#endif // CHIP_DEVICE_CONFIG_ENABLE_THREAD

        // Post a CHIPoBLEAdvertisingChange(Stopped) event.
        {
            ChipDeviceEvent advChange;
            advChange.Type                             = DeviceEventType::kCHIPoBLEAdvertisingChange;
            advChange.CHIPoBLEAdvertisingChange.Result = kActivity_Stopped;
            PlatformMgr().PostEvent(&advChange);
        }
    }

exit:
    return err;
}

CHIP_ERROR BLEManagerImpl::EncodeAdvertisingData(ble_gap_adv_data_t & gapAdvData)
{
    CHIP_ERROR err = CHIP_NO_ERROR;
    ble_advdata_t advData;
    ble_advdata_service_data_t serviceData;
    ChipBLEDeviceIdentificationInfo deviceIdInfo;

    // Form the contents of the advertising packet.
    memset(&advData, 0, sizeof(advData));
    advData.name_type               = BLE_ADVDATA_FULL_NAME;
    advData.include_appearance      = false;
    advData.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    advData.uuids_complete.uuid_cnt = 1;
    advData.uuids_complete.p_uuids  = (ble_uuid_t *) &UUID_CHIPoBLEService;
    gapAdvData.adv_data.p_data      = mAdvDataBuf;
    gapAdvData.adv_data.len         = sizeof(mAdvDataBuf);
    err                             = ble_advdata_encode(&advData, mAdvDataBuf, &gapAdvData.adv_data.len);
    SuccessOrExit(err);

    // Initialize the CHIP BLE Device Identification Information block that will be sent as payload
    // within the BLE service advertisement data.
    // TODO: retrive device configuration from the ConfigurationMgr()
    // err = ConfigurationMgr().GetBLEDeviceIdentificationInfo(deviceIdInfo);
    deviceIdInfo.Init();
    deviceIdInfo.SetVendorId(0xDEAD);
    deviceIdInfo.SetProductId(0xBEEF);
    SuccessOrExit(err);

    // Form the contents of the scan response packet.
    memset(&serviceData, 0, sizeof(serviceData));
    serviceData.service_uuid = UUID16_CHIPoBLEService;
    serviceData.data.size    = sizeof(deviceIdInfo);
    serviceData.data.p_data  = (uint8_t *) &deviceIdInfo;
    memset(&advData, 0, sizeof(advData));
    advData.name_type               = BLE_ADVDATA_NO_NAME;
    advData.include_appearance      = false;
    advData.p_service_data_array    = &serviceData;
    advData.service_data_count      = 1;
    gapAdvData.scan_rsp_data.p_data = mScanRespDataBuf;
    gapAdvData.scan_rsp_data.len    = sizeof(mScanRespDataBuf);
    err                             = ble_advdata_encode(&advData, mScanRespDataBuf, &gapAdvData.scan_rsp_data.len);
    SuccessOrExit(err);

